---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidInputWarn
source: html/81771105-3a9d-5973-79b3-014b4f3af4bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidInputWarn Property

Invalid Input

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidInputWarn { get; }
```